In [1]:
%matplotlib inline
import pandas as pd

In [2]:
#from IPython.core.display import HTML
#css = open('style-table.css').read() + open('style-notebook.css').read()
#HTML('<style>{}</style>'.format(css))

In [3]:
titles = pd.read_csv('titles.csv')
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

In [4]:
cast = pd.read_csv('cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [5]:
release_dates = pd.read_csv('release_dates.csv')
release_dates.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                   #BKKY  2016     Cambodia  2017-10-12
2                 #Beings  2015      Romania  2015-01-29
3               #Captured  2017          USA  2017-09-05
4  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21

### How many movies are listed in the titles dataframe?

In [6]:
titles['title'].count()

244914

In [7]:
titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [8]:
titles.sort_values(by=['year']).head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [9]:
titles[titles['title']=='Hamlet'].head()

        title  year
6422   Hamlet  2017
10637  Hamlet  1921
39916  Hamlet  1913
52521  Hamlet  1910
62000  Hamlet  2000

In [10]:
titles[titles['title']=='Hamlet'].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [11]:
titles[titles['title']=='North by Northwest'].head()

                    title  year
74398  North by Northwest  1959

In [12]:
titles[titles['title']=='North by Northwest'].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [13]:
titles[titles['title']=='Hamlet'].sort_values(by='year').head()

         title  year
52521   Hamlet  1910
198234  Hamlet  1911
39916   Hamlet  1913
10637   Hamlet  1921
101728  Hamlet  1948

### List all of the "Treasure Island" movies from earliest to most recent.

In [14]:
titles[titles['title']=='Treasure Island'].sort_values(by='year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

In [15]:
titles[titles['title']=='Treasure Island'].sort_values(by='year').count()

title    8
year     8
dtype: int64

### How many movies were made in the year 1950?

In [16]:
titles[titles['year']==1950].count()

title    1113
year     1113
dtype: int64

In [17]:
titles[titles['year']==1950].head()

                  title  year
189  La soif des hommes  1950
268    Sohrab at Rustum  1950
308               Gemma  1950
314        Rasuna valea  1950
524  Trial Without Jury  1950

### How many movies were made in the year 1960?

In [18]:
titles[titles['year']==1960].count()

title    1549
year     1549
dtype: int64

In [19]:
titles[titles['year']==1960].head()

                     title  year
52     Tayna Dimki Karmiya  1960
88   Tres angelitos negros  1960
226           Viuda de oro  1960
227        Tao se feng yun  1960
590   Mahallenin sevgilisi  1960

### How many movies were made from 1950 through 1959?

In [20]:
titles[(titles['year']>=1950) & (titles['year']<=1959)].count()

title    12934
year     12934
dtype: int64

### In what years has a movie titled "Batman" been released?

In [21]:
x = titles[titles['title']=='Batman']
print(x['year'])

39349     1943
240896    1989
Name: year, dtype: int64

### How many roles were there in the movie "Inception"?

In [22]:
y = cast[cast['title']=='Inception']
print(y['character'].count())

78

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [23]:
y['n'].isnull().sum()

27

### But how many roles in the movie "Inception" did receive an "n" value?

In [24]:
y['n'].count()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [25]:
a = cast[cast['title']=='North by Northwest']
a = a.dropna(axis=0,subset=['n'])
a.sort_values(by = 'n')
list(a['name'])

['Edward Binns',
 'Leo G. Carroll',
 'Philip Coolidge',
 'Robert Ellenstein',
 'Cary Grant',
 'Martin Landau',
 'Ken Lynch',
 'James Mason',
 'Patrick McVey',
 'Philip Ober',
 'Edward Platt',
 'Les Tremayne',
 'Adam Williams',
 'Josephine Hutchinson',
 'Jessie Royce Landis',
 'Eva Marie Saint']

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [26]:
b = cast[(cast['title']=='Sleuth') & (cast['year']==1972)]
b.sort_values(by = 'n')
list(b['name'])

['Michael Caine',
 'Alec Cawthorne',
 'Teddy Martin',
 'John (II) Matthews',
 'Laurence Olivier',
 'Eve (III) Channing']

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [27]:
c = cast[(cast['title']=='Sleuth') & (cast['year']==2007)]
c.sort_values(by = 'n')
list(c['name'])

['Kenneth Branagh',
 'Michael Caine',
 'Alec (II) Cawthorne',
 'Jude Law',
 'Harold Pinter',
 'Eve (II) Channing',
 "Carmel O'Sullivan"]

### How many roles were credited in the silent 1921 version of Hamlet?

In [28]:
d = cast[(cast['title']=='Hamlet') & (cast['year']==1921)]
d['character'].count()

9

### How many roles were credited in Branagh’s 1996 Hamlet?

In [29]:
e = cast[(cast['title']=='Hamlet') & (cast['year']==1996)]
e['character'].count()

54

### How many "Hamlet" roles have been listed in all film credits through history?

In [30]:
f = cast[cast['title']=='Hamlet']
f['character'].count()

342

### How many people have played an "Ophelia"?

In [31]:
g = cast[cast['character']=='Ophelia']
g['name'].drop_duplicates().count()

115

### How many people have played a role called "The Dude"?

In [32]:
h = cast[cast['character']=='The Dude']
h['name'].drop_duplicates().count()

19

### How many people have played a role called "The Stranger"?

In [33]:
i = cast[cast['character']=='The Stranger']
i['name'].drop_duplicates().count()

202

### How many roles has Sidney Poitier played throughout his career?

In [34]:
j = cast[cast['name']=='Sidney Poitier']
j['character'].drop_duplicates().count()

41

### How many roles has Judi Dench played?

In [35]:
k = cast[cast['name']=='Judi Dench']
k['character'].drop_duplicates().count()

46

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [38]:
l = cast[(cast['name']=='Cary Grant') & (cast['year']>=1940) & (cast['year']<=1949) & (cast['n']==2)]
l.sort_values(by = 'year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [39]:
m = cast[(cast['name']=='Cary Grant') & (cast['year']>=1940) & (cast['year']<=1949)]
m.sort_values(by = 'year')

,title,year,name,type,character,n
871450,The Philadelphia Story,1940,Cary Grant,actor,C. K. Dexter Haven,1.0
871448,The Howards of Virginia,1940,Cary Grant,actor,Matt Howard,1.0
871407,His Girl Friday,1940,Cary Grant,actor,Walter Burns,1.0
871423,My Favorite Wife,1940,Cary Grant,actor,Nick Arden,2.0
871438,Suspicion,1941,Cary Grant,actor,Johnnie Aysgarth,1.0
871433,Penny Serenade,1941,Cary Grant,actor,Roger Adams,2.0
871452,The Talk of the Town,1942,Cary Grant,actor,Leopold Dilg,1.0
871429,Once Upon a Honeymoon,1942,Cary Grant,actor,Patrick 'Pat' O'Toole,1.0
871398,Destination Tokyo,1943,Cary Grant,actor,Capt. Cassidy,1.0
871422,Mr. Lucky,1943,Cary Grant,actor,Joe Adams -posing as Joe Bascopolous,1.0
871390,Arsenic and Old Lace,1944,Cary Grant,actor,Mortimer Brewster,1.0
871430,Once Upon a Time,1944,Cary Grant,actor,Jerry Flynn,1.0
871425,None But the Lonely Heart,1944,Cary Grant,actor,Ernie Mott,1.0
871405,George White's Scandals,1945,Cary Grant,actor,Cary Grant,NaN
871424,Night and Day,1946,Cary Grant,actor,Cole Porter,1.0
871427,Notorious,1946,Cary Grant,actor,Devlin,1.0
871466,Without Reservations,1946,Cary Grant,actor,Cary Grant,NaN
871444,The Bachelor and the Bobby-Soxer,1947,Cary Grant,actor,Dick Nugent,1.0
871445,The Bishop's Wife,1947,Cary Grant,actor,Dudley,1.0
871421,Mr. Blandings Builds His Dream House,1948,Cary Grant,actor,Jim Blandings,1.0
871402,Every Girl Should Be Married,1948,Cary Grant,actor,Dr. Madison Brown,1.0
871411,I Was a Male War Bride,1949,Cary Grant,actor,Captain Henri Rochard,1.0

### How many roles were available for actors in the 1950s?

In [42]:
n = cast[(cast['year']>=1950) & (cast['year']<=1959)]
n['character'].count()

215471

In [46]:
n = cast[(cast['year']>=1950) & (cast['year']<=1959)]
n['character'].drop_duplicates().count()

128233

### How many roles were available for actresses in the 1950s?

In [47]:
o = cast[(cast['type']=='actress') & (cast['year']>=1950) & (cast['year']<=1959)]
o['character'].drop_duplicates().count()

36266

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [48]:
p = cast[(cast['n']==1) & (cast['year']>=1980)]
p['character'].drop_duplicates().count()

57697

### How many non-leading roles were available through from the beginning of film history through 1980?

In [50]:
q = cast[(cast['n']>1) & (cast['year']>=1980)]
q['character'].dropna().drop_duplicates().count()

689115

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [54]:
r = cast[(cast['n'].isna()) & (cast['year']>=1980)]
r['character'].count()

1014692